app/Http/Controllers/Auth/VerificationController.php

    public function verify(Request $request)
    {
        $request->validate([
            'email' => 'required|email',
            'code' => 'required|numeric',
        ]);

        // Kiểm tra thông tin người dùng từ session
        $userData = $request->session()->get('user_data');

        if ($userData && $userData['email'] === $request->email && $userData['verification_code'] == $request->code) {
            // Lưu người dùng vào cơ sở dữ liệu
            $user = User::create([
                'full_name' => $userData['full_name'],
                'email' => $userData['email'],
                'password' => $userData['password'],
                'email_verified_at' => now(), // Đánh dấu email đã được xác minh
                'verification_code' => $userData['verification_code'],
            ]);
---
insert into `users` (`full_name`, `email`, `password`, `email_verified_at`, `verification_code`, `updated_at`, `created_at`) values ('gwyn111123@lindse.shop', 'gwyn111123@lindse.shop', '$2y$12$VR421Yv40sTCA5YvdKUTA.qz6BB.NVhGrwvQd7DVS1yC7/GLQddBi', '2024-12-05 11:03:18', 424597, '2024-12-05 11:03:18', '2024-12-05 11:03:18')