routes/web.php

select * from `sale_news` where `status` = '1' and `is_delete` is null and `approved` = '1'
---

// guest

Route::get('/', function () {
    $data = \App\Models\SaleNews::where('status','1')->with('images')->where('is_delete',null)->where('approved','1')->get();  // Truyền dữ liệu trực tiếp ở đây
    return view('home', ['data' => $data]);
})->name('home');