app/Http/Controllers/ChannelController.php

    public function index()
    {

        $user = Auth::user();
        $channels = Channel::where('user_id', $user->user_id)->firstOrFail(); // Lấy kênh của người dùng
        // dd($channels);
        if (!$channels || is_null($channels->status)) {
            return redirect()->route('channels.create') // Chuyển hướng đến trang tạo kênh
                ->with('error', 'You have not created a channel yet or the channel status is not set.');
        }
        $sale_news = $channels->saleNews()->with('sub_category', 'firstImage')
            ->where('approved', 1)
            ->paginate(5);

        foreach ($sale_news as $news) {
            $news->name_sub_category = $news->sub_category ? $news->sub_category->name_sub_category : null;
        }

        // Count records of sub_category based on name
        $subcategory_count = $sale_news->filter(function ($news) {
            return $news->sub_category !== null;
        })->countBy('name_sub_category');

        // Count the number of news items that the channel has posted
        $NewsCount = $channels->saleNews()->count();
        $category = Category::all();

        $isFollowed = UserFollowed::where('user_id', $user->user_id)
            ->where('channel_id', $channels->channel_id)
            ->exists();
---
select * from `channels` where `user_id` = 13 limit 1
select count(*) as aggregate from `sale_news` where `sale_news`.`channel_id` = 39 and `sale_news`.`channel_id` is not null and `approved` = 1
select count(*) as aggregate from `sale_news` where `sale_news`.`channel_id` = 39 and `sale_news`.`channel_id` is not null
select exists(select * from `user_followed` where `user_id` = 13 and `channel_id` = 39) as `exists`

    public function create()
    {
        $user = Auth::user();


        // Kiểm tra nếu người dùng đã tạo kênh
        $channelExists = Channel::where('user_id', $user->user_id)->whereNotNull('status')->exists();
        if ($channelExists) {
            return redirect()->route('channels.show', ['channel' => $user->channel->channel_id])
                ->with('success', 'You already have a channel.');
        }

        $vipPackages = VipPackage::where('type', 'channel')->get();
        $paymentOrCreat = Channel::where('user_id', $user->user_id)->first();
---
select exists(select * from `channels` where `user_id` = 13 and `status` is not null) as `exists`
select * from `vip_packages` where `type` = 'channel'
select * from `channels` where `user_id` = 13 limit 1

    public function store(Request $request)
    {
        // dd($request);
        // Kiểm tra xem người dùng đã có kênh chưa
        $user = Auth::user();

        $existingChannel = Channel::where('user_id', $user->user_id)->first();
---
select * from `channels` where `user_id` = 13 limit 1

            $channel->image_channel = 'storage/' . $path;
        }

        $channel->save();
---
insert into `channels` (`user_id`, `name_channel`, `phone_number`, `address`, `status`, `vip_package_id`, `image_channel`, `updated_at`, `created_at`) values (13, '424597', '0763636329', 'Phường Trúc Bạch, Quận Ba Đình, Thành phố Hà Nội', null, '5', 'storage/channels/j7t0gt14CuzB98AteJZ2HypLLVgyvaH41hywJau0.jpg', '2024-12-05 11:07:47', '2024-12-05 11:07:47')

    public function show(string $id)
    {
        $user = Auth::user(); // Lấy thông tin người dùng nếu đã đăng nhập
        $channel = Channel::where('user_id', $user->user_id ?? null)->first(); // Lấy kênh nếu người dùng đã đăng nhập

        // Lấy thông tin của kênh đang được xem
        $information = ChannelInfo::where('channel_id', $id)->first();
        $channels = Channel::findOrFail($id); // Lấy kênh theo ID

        // Lấy danh sách tin đã được duyệt thuộc kênh
        $sale_news = $channels->saleNews()->with('sub_category', 'firstImage')
            ->where('approved', 1)
            ->paginate(5);

        foreach ($sale_news as $news) {
            $news->name_sub_category = $news->sub_category ? $news->sub_category->name_sub_category : null;
        }

        // Đếm số lượng bản ghi theo sub_category
        $subcategory_count = $sale_news->filter(function ($news) {
            return $news->sub_category !== null;
        })->countBy('name_sub_category');
        // Đếm số lượng tin mà kênh đã đăng
        $NewsCount = $channels->saleNews()->count();
        $category = Category::all();
        // Kiểm tra nếu người dùng đã theo dõi kênh (nếu đã đăng nhập)
        $isFollowed = false;
        if ($user) {
            $isFollowed = UserFollowed::where('user_id', $user->user_id)
                ->where('channel_id', $channels->channel_id)
                ->exists();
---
select * from `channels` where `user_id` = 7 limit 1
select * from `channels` where `channels`.`channel_id` = '35' limit 1
select * from `sale_news` where `sale_news`.`channel_id` = 35 and `sale_news`.`channel_id` is not null and `approved` = 1 limit 5 offset 0
select * from `sub_categories` where `sub_categories`.`sub_category_id` in (119, 155)
select count(*) as aggregate from `sale_news` where `sale_news`.`channel_id` = 35 and `sale_news`.`channel_id` is not null and `approved` = 1
select count(*) as aggregate from `sale_news` where `sale_news`.`channel_id` = 35 and `sale_news`.`channel_id` is not null
select exists(select * from `user_followed` where `user_id` = 7 and `channel_id` = 35) as `exists`