app/Http/Controllers/PartnerProfileController.php

select * from `channels` where `user_id` = 13
---
    public function index()
    {
        if (!Auth::check()) {
            return redirect()->route('login')->with('error', 'You must be logged in to view your channels.');
        }

        $user = Auth::user();
        $profiles = Channel::where('user_id', $user->user_id)->get();