app/Http/Controllers/SaleNewsController.php

select * from `categories`
---
    public function create()
    {
        $categories = Category::all();

select * from `categories`
select * from `channels` where `user_id` = 7 limit 1
---
    public function createSaleNewsPartner()
    {
        $categories = Category::all();

        $channels = Channel::where('user_id', auth()->user()->user_id)->first();

insert into `sale_news` (`user_id`, `title`, `price`, `description`, `sub_category_id`, `data`, `phone`, `address`, `approved`, `status`, `created_at`) values (7, '12323', '123123', '12323', '119', '[{\"name\":\"1\",\"option\":\"123\"},{\"name\":\"3\",\"option\":\"123\"},{\"name\":\"4\",\"option\":\"123\"}]', '0763636353', '123, Thành phố Hà Nội, Quận Hoàn Kiếm, Phường Đồng Xuân', 0, 1, '2024-12-05 10:55:26')
---
            // $query=DB::table('sale_news')->insert($productData);


            $insertSaleNews = DB::table('sale_news')->insertGetId($productData);

insert into `photo_gallery` (`created_at`, `image_name`, `sale_new_id`) values ('2024-12-05 10:55:26', 'storage/sale-news/sale-news_1733396126_6751869e07742.jpg', 26)
---
                ];
            }
            if (!empty($imageRecords)) {
                DB::table('photo_gallery')->insert($imageRecords);

select `vip_package_id`, `vip_start_at`, `vip_end_at` from `channels` where `user_id` = 7 limit 1
---


            // $jsonData = json_encode($validatedData['variant']);
            $channel = Channel::where('user_id', auth()->user()->user_id)->first(['vip_package_id', 'vip_start_at', 'vip_end_at']);

insert into `sale_news` (`user_id`, `channel_id`, `title`, `price`, `description`, `sub_category_id`, `data`, `address`, `phone`, `approved`, `status`, `vip_package_id`, `vip_start_at`, `vip_end_at`, `created_at`) values (7, '35', '2323', '234234', '23434', '119', '[\n    {\n        \"name\": \"1\",\n        \"option\": \"23423\"\n    },\n    {\n        \"name\": \"3\",\n        \"option\": \"4234\"\n    },\n    {\n        \"name\": \"4\",\n        \"option\": \"234\"\n    }\n]', '262 Tôn Đản, Phường Hòa An, Quận Cẩm Lệ, Thành phố Đà Nẵng', '0763636353', 1, 1, 5, '2024-11-23 10:29:29', '2024-12-23 10:29:29', '2024-12-05 10:55:29')
---
            // $query=DB::table('sale_news')->insert($productData);


            $insertSaleNews = DB::table('sale_news')->insertGetId($productData);

insert into `photo_gallery` (`created_at`, `image_name`, `sale_new_id`) values ('2024-12-05 10:55:29', 'storage/sale-news/sale-news_1733396129_675186a19648a.jpg', 27)
---
                ];
            }
            if (!empty($imageRecords)) {
                DB::table('photo_gallery')->insert($imageRecords);

update `sale_news` set `views` = `views` + 1 where `sale_new_id` = '21'
select * from `channels` where `channels`.`channel_id` in (37)
select * from `sale_news` where `sale_new_id` = '21' and `approved` = 1 limit 1
select * from `sub_categories` where `sub_categories`.`sub_category_id` in (158)
select count(*) as aggregate from `sale_news` where `channel_id` = 37 and `approved` = 1 and `status` = 1
select count(*) as aggregate from `sale_news` where `channel_id` = 37 and `approved` = 1 and `status` = 0
select * from `users` where `user_id` = 12 limit 1
select * from `sale_news` where `sub_category_id` = 158 and `vip_package_id` is not null order by `created_at` desc limit 7
---
    public function renderSaleNewDetail(string $id)
    {
        // dd($get_data_7subcategory);
        try {
            $update_views = DB::table('sale_news')->where('sale_new_id', $id)->increment('views', 1);

            $news = SaleNews::with(['channel', 'images', 'firstImage', 'category', 'sub_category'])
                ->where('sale_new_id', $id)
                ->where('approved', 1)->first();


            if (!is_null($news->channel_id)) {
                $data_count_news = DB::table('sale_news')->where('channel_id', $news->channel_id)->where('approved', 1)->where('status', 1)->count();
                $data_count_news_sold = DB::table('sale_news')->where('channel_id', $news->channel_id)->where('approved', 1)->where('status', 0)->count();
            }



            $get_user_phone = DB::table('users')->where('user_id', $news->user_id)->first();
            $get_data_7subcategory = SaleNews::with(['channel', 'images', 'firstImage', 'sub_category'])
                ->where('sub_category_id', $news->sub_category_id)
                ->whereNotNull('vip_package_id')
                ->latest()
                ->take(7)
                ->get();