app/Http/Controllers/TransactionController.php

    public function index()
    {
        $data = Transactions::with(['user', 'channel'])->get();
---
select * from `channels` where `channels`.`channel_id` in (40)
select * from `transactions` where `user_id` = 13
select * from `users` where `users`.`user_id` in (13)