app/Http/Controllers/UserManageController.php

select * from `user_followed` where `user_id` = 13
select count(*) as aggregate from `transactions` where `user_id` = 13
---
    public function index()
    {
        $userId = Auth::id();
        $followedChannels = UserFollowed::where('user_id', $userId)
            ->with('channel')
            ->get();
        $transactionCount = Transactions::where('user_id', $userId)->count();