app/Http/Controllers/UsermanagementController.php

    public function index()
    {
        $data = DB::table('users')->get();
---
select * from `users`