app/Http/Controllers/VnPayController.php

                'created_at' => now(),
            ];
            // $query = DB::table('transactions')->insert($transactionData);
            $transactionsID = DB::table('transactions')->insertGetId($transactionData);
---
insert into `transactions` (`user_id`, `channel_id`, `sale_news_id`, `amount`, `currency`, `status`, `transaction_date`, `vnp_response_code`, `vnp_transaction_no`, `payment_method`, `description`, `vnp_BankCode`, `vnp_BankTranNo`, `vnp_TmnCode`, `vnp_TxnRef`, `upgrade`, `created_at`) values (13, 38, null, 60000, 'USD', 'Success', '2024-12-05 18:04:05', '00', '14722848', 'ATM', 'CN_13_5_38_SIH7DMIC', 'NCB', 'VNP14722848', 'KA9BQ8KD', 'CN_13_5_38_SIH7DMIC', 'Upgrade Channel', '2024-12-05 11:04:20')

                $route = 'channels';
            }

            $user = User::where('user_id', Auth()->user()->user_id)->first();
---
select * from `users` where `user_id` = 13 limit 1