app/Providers/AppServiceProvider.php

    public function boot(): void
    {
        $setting = Setting::first() ?? new Setting();
        View::share('setting', $setting);
        View::composer('*', function ($view) {
            // Loại trừ các view trong thư mục admin
            if (str_starts_with($view->getName(), 'admin')) {
                return; // Không chia sẻ biến với view admin
            }

            // Lấy tất cả các thông báo công khai
            $notifications_userid = Notification::where('status', 'public')->get();
            $notification_web = Notification::where('type', 'website')->get();
---
select * from `notifications` where `status` = 'public' and `notifications`.`deleted_at` is null
select * from `notifications` where `type` = 'website' and `notifications`.`deleted_at` is null